InformationRegisters/ФотографииКошек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФотографииКошек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФотографияКошки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ФормаСообщения/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьСообщения()
	Сообщения.Очистить();
	РезультатОпределенияПороды = "";
	
	СообщенияДиалога = GigaChat_Сервер.ПолучитьСообщенияДиалога(Новый УникальныйИдентификатор(ИдентификаторДиалога));
	Для Каждого СообщениеДиалога Из СообщенияДиалога Цикл
		Если НЕ СообщениеДиалога.ОпределениеПороды Тогда
			НС = Сообщения.Добавить();
			НС.ИдентификаторСообщения = СообщениеДиалога.ИдентификаторСообщения;
			НС.ВремяОтправки = СообщениеДиалога.ДатаОтправки;
			НС.Содержимое = СообщениеДиалога.Содержимое;
			НС.ОтПользователя = СообщениеДиалога.ОтПользователя;
		Иначе
			Если НЕ СообщениеДиалога.ОтПользователя Тогда
				РезультатОпределенияПороды = СообщениеДиалога.Содержимое;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИдентификаторДиалога") <> Неопределено Тогда
		ИдентификаторДиалога = Новый УникальныйИдентификатор(Параметры.ИдентификаторДиалога);
	КонецЕсли;
	//
	Если Параметры.Свойство("Наименование") <> Неопределено Тогда
		Наименование = Параметры.Наименование;
	КонецЕсли;
	//
	ОбновитьСообщения();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСообщение(Команда)
	
	Подсказка = "Введите содержимое сообщения";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСодержимогоСообщения", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСодержимогоСообщения(Содержимое, Параметры) Экспорт
	
	Если НЕ Содержимое = Неопределено И НЕ Содержимое = "" Тогда
		НовоеСообщение = GigaChat_Сервер.СоздатьСообщение(Новый УникальныйИдентификатор(ИдентификаторДиалога),Содержимое);
		ОбновитьСообщения();
	ИначеЕсли Содержимое = "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сообщение не может быть пустым!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСообщение(Команда)
	ТД = ЭтаФорма.Элементы.Сообщения.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		GigaChat_Сервер.УдалитьСообщение(Новый УникальныйИдентификатор(ИдентификаторДиалога),Новый УникальныйИдентификатор(ТД.ИдентификаторСообщения),ТД.ОтПользователя);
		ОбновитьСообщения();	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьКартинку(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьКартинкуЗавершение", ЭтотОбъект);
    НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор);
КонецПроцедуры  

&НаКлиенте
Процедура ЗагрузитьКартинкуЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
    
    Если НЕ Результат Тогда
        Возврат;
    КонецЕсли;
    
    АдресКартинки = Адрес;
    Модифицированность = Истина;
    
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьПороду(Команда)
	Содержимое = "Определи породу кошки по фото. Ответ в формате: Название породы на русском (на английском)";
	НовоеСообщение = GigaChat_Сервер.СоздатьСообщениеСКартинкой(Новый УникальныйИдентификатор(ИдентификаторДиалога), Содержимое, АдресКартинки);
	ОбновитьСообщения();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФото(Команда)
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыбратьФотоЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораФотографии", , ЭтаФорма, , , , ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФотоЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресФотографии = АдресФотографии(Результат); 
	
	Если АдресФотографии = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось загрузить выбранную фотографию!");
		Возврат;
	КонецЕсли;
	
	АдресКартинки = АдресФотографии;
	Модифицированность = Истина;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция АдресФотографии(ПараметрыОтбора) 
	
	ФотографияКошки = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФотографииКошек.ФотографияКошки КАК ФотографияКошки
		|ИЗ
		|	РегистрСведений.ФотографииКошек КАК ФотографииКошек
		|ГДЕ
		|	ФотографииКошек.Кошка = &Кошка
		|	И ФотографииКошек.ИмяФайла = &ИмяФайла";
	
	Запрос.УстановитьПараметр("ИмяФайла", ПараметрыОтбора.ИмяФайла);
	Запрос.УстановитьПараметр("Кошка", ПараметрыОтбора.Кошка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ФотографияКошки = ПоместитьВоВременноеХранилище(Выборка.ФотографияКошки.Получить());
	КонецЕсли;
	
	Возврат ФотографияКошки;
	
КонецФункции
